Config/Documents/РаспоряжениеОПеречисленииНаКартыМир.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РаспоряжениеОПеречисленииНаКартыМир</Name>
			<BasedOn>
				<xr:Item>Document.РеестрВедомостейНаВыплатуЗарплаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БезналичныеДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень получателей, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникКонтрагент</Name>
					<Comment>0 - перечисление сотрудникам, 1 - контрагентам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДенежногоОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрВедомостейНаВыплатуЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИзвещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзвещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНеподтвержденныхВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПодтвержденныхВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОисполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Взыскано</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВыплатНаКартуМИР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВыплатНаКартыМИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВидаДохода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеКартыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРожденияДержателяКарты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВыплатНаКартуМИР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВыплатНаКартыМИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ТипыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Казначейский</Name>
					<Comment>Лицевой счет открыт в органе казначейства или финансовом органе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РаспоряжениеОПеречисленииНаКартыМир/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Параметры.Основание) Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) Тогда
				ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию();
			Иначе
				ПриИзмененииЛицевогоСчетаНаСервере();
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьДобавленныеКолонкиТаблиц();
		
	КонецЕсли;
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ГодДокумента", Год(Объект.Дата)); 
	Если ЗначениеЗаполнено(Объект.ДокументОснование) 
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеестрВедомостейНаВыплатуЗарплаты") Тогда
		ЭтотОбъект.КэшПараметров.Локальные.Вставить("НеИзменятьКарту", Истина); 
	Иначе
		ЭтотОбъект.КэшПараметров.Локальные.Вставить("НеИзменятьКарту", Ложь); 
	КонецЕсли;	
		
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
	
	УстановитьВидимостьСотрудникКонтрагент(Элементы, Объект.СотрудникКонтрагент = 0);
	
	УстановитьВидимостьЭлементов();    
	
	УстановитьОтображениеОшибок();
		
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтотОбъект);
	
	ПлатежноРасчетныеДокументы.ЗаполнитьСписокВыбораКодовДохода(Элементы.СоставПодробноКодВидаДохода);

	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом  
	
	ДокументОснованиеЗаголовок = ?(ЗначениеЗаполнено(Объект.ДокументОснование), Объект.ДокументОснование, "<не указан>");
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма,
												   ТекущийОбъект, 
												   Элементы.БухгалтерскаяОперация, 
												   Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части

	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);  
	
	ПлатежноРасчетныеДокументы.ПередЗаписьюНаСервереДокумента(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ПлатежноРасчетныеДокументыКлиент.ОбработатьОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
		
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ГодДокумента", Год(Объект.Дата));
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			//УстановитьОтветственныхЛиц(Объект.Организация, Объект.Подразделение, Объект.Дата, Объект.Руководитель, Объект.ГлБухгалтер);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ПриИзмененииЛицевогоСчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, ТипЛицевогоСчета, НаДату", Объект.Организация, Объект.РеквизитыЛицевогоСчета, ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Казначейский"), Объект.Дата);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.РеквизитыЛицевогоСчета 	= ВыбранноеЗначение;
	ПолучитьЛицевойСчетОрганКазначейства();

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникКонтрагентПриИзменении(Элемент)
	
	Если Объект.Состав.Количество() > 0 Тогда
		
		Если Объект.СотрудникКонтрагент = 0
			И Объект.Состав.НайтиСтроки(Новый Структура("Контрагент",
				ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"))).Количество() <> Объект.Состав.Количество() Тогда
			
			ТекстВопроса = НСтр("ru = 'Список контрагентов будет очищен. Продолжить?'");
			ОписаниеОповещенияИзменение = Новый ОписаниеОповещения("ДействияПриИзмененииСпособаЗаполнения", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияИзменение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20);
			Возврат;
		КонецЕсли;
		
		Если Объект.СотрудникКонтрагент = 1
			И Объект.Состав.НайтиСтроки(Новый Структура("Сотрудник",
				ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"))).Количество() <> Объект.Состав.Количество() Тогда
			
			ТекстВопроса = НСтр("ru = 'Список сотрудников будет очищен. Продолжить?'");
			ОписаниеОповещенияИзменение = Новый ОписаниеОповещения("ДействияПриИзмененииСпособаЗаполнения", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияИзменение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьСотрудникКонтрагент(Элементы, Объект.СотрудникКонтрагент = 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриИзмененииСпособаЗаполнения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.СотрудникКонтрагент = ?(Объект.СотрудникКонтрагент = 0, 1, 0);
		Возврат;
	КонецЕсли;
	
	Объект.Состав.Очистить();
	Объект.РасшифровкаПлатежа.Очистить();
	
	УстановитьВидимостьСотрудникКонтрагент(Элементы, Объект.СотрудникКонтрагент = 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура УстановленныйСтатусДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭтогоДокументаНажатие(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ДокументОснованиеЗаголовок = ?(ЗначениеЗаполнено(Объект.ДокументОснование), Объект.ДокументОснование, "<не указан>");
КонецПроцедуры 

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставПодробно

&НаКлиенте
Процедура СоставПодробноПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ОтборДляРасшифровкиПлатежа(Элемент.ТекущиеДанные.ИдентификаторСтроки);
		ИдентификаторТекущейСтроки = Элемент.ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПодробноПередУдалением(Элемент, Отказ)
	УдалитьСтрокиРасшифровкиПлатежа(Элемент.ВыделенныеСтроки);
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоставПодробноПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		// скопируем также классификацию
		ТекущаяКлассификация.Очистить();
		СтрокиДляКопирования = Объект.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ИдентификаторСтроки",ИдентификаторТекущейСтроки));
		Для Каждого Строка Из СтрокиДляКопирования Цикл
			ЗаполнитьЗначенияСвойств(ТекущаяКлассификация.Добавить(),Строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПодробноПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.СоставПодробно.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		ИдентификаторТекущейСтроки = Элементы.СоставПодробно.ТекущиеДанные.ИдентификаторСтроки;
		Если Копирование Тогда
			Для Каждого Строка Из ТекущаяКлассификация Цикл
				НоваяСтрокаРасшифровки = Объект.РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРасшифровки,Строка);
				НоваяСтрокаРасшифровки.ИдентификаторСтроки = Элементы.СоставПодробно.ТекущиеДанные.ИдентификаторСтроки;
			КонецЦикла;
			РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
		КонецЕсли;
		ОтборДляРасшифровкиПлатежа(Элементы.СоставПодробно.ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли; 
	
	Если Элемент.ТекущийЭлемент.Имя = "СоставПодробноОшибка" Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Элементы.СоставПодробно.ТекущиеДанные.ОписаниеОшибки) Тогда
			ПараметрыФормыОшибок = Новый Структура("СведенияОбОшибках", Элементы.СоставПодробно.ТекущиеДанные.ОписаниеОшибки);
						ОткрытьФорму("Документ.РаспоряжениеОПеречисленииНаКартыМир.Форма.ФормаОписанияОшибки", ПараметрыФормыОшибок, ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
		КонецЕсли; 
	КонецЕсли;  
		
КонецПроцедуры   

&НаКлиенте
Процедура СоставПодробноСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставПодробно.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Контрагент) 
		И ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		ПолучитьКонтрагентаСотрудника(ТекущиеДанные.Сотрудник, 
		ТекущиеДанные.Контрагент, 
		ТекущиеДанные.ПлатежнаяКарта, 
		ТекущиеДанные.НомерПлатежнойКарты, 
		ТекущиеДанные.ДатаРожденияДержателяКарты,
		ЭтотОбъект.КэшПараметров.Локальные.НеИзменятьКарту); 
		Элементы.СоставПодробно.ТекущиеДанные.МаскированныйНомерКарты = МаскированныйНомерКарты(Элементы.СоставПодробно.ТекущиеДанные.НомерПлатежнойКарты);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Контрагент) Тогда
		Элементы.СоставПодробно.ЗакончитьРедактированиеСтроки(Истина);
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура СоставПодробноКонтрагентПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставПодробно.ТекущиеДанные;
	ПолучитьПлатежнуюКарту(ТекущиеДанные.Контрагент, 
	ТекущиеДанные.ПлатежнаяКарта, 
	ТекущиеДанные.НомерПлатежнойКарты, 
	ТекущиеДанные.ДатаРожденияДержателяКарты,
	ЭтотОбъект.КэшПараметров.Локальные.НеИзменятьКарту);
	ТекущиеДанные.МаскированныйНомерКарты = МаскированныйНомерКарты(Элементы.СоставПодробно.ТекущиеДанные.НомерПлатежнойКарты);
КонецПроцедуры

&НаКлиенте
Процедура СоставПодробноСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь; 
		ТекущиеДанные = Элементы.СоставПодробно.ТекущиеДанные;
		ТекущиеДанные.Сотрудник = ВыбранноеЗначение.Ссылка;
		ТекущиеДанные.Контрагент = ВыбранноеЗначение.Контрагент; 
		ПолучитьПлатежнуюКарту(ТекущиеДанные.Контрагент, 
		ТекущиеДанные.ПлатежнаяКарта, 
		ТекущиеДанные.НомерПлатежнойКарты, 
		ТекущиеДанные.ДатаРожденияДержателяКарты,
		ЭтотОбъект.КэшПараметров.Локальные.НеИзменятьКарту); 
		Элементы.СоставПодробно.ТекущиеДанные.МаскированныйНомерКарты = МаскированныйНомерКарты(Элементы.СоставПодробно.ТекущиеДанные.НомерПлатежнойКарты);
	Иначе
		Элементы.СоставПодробно.ТекущиеДанные.Контрагент = ""; 
		Элементы.СоставПодробно.ТекущиеДанные.МаскированныйНомерКарты = "";
		Элементы.СоставПодробно.ТекущиеДанные.НомерПлатежнойКарты = "";
		Элементы.СоставПодробно.ТекущиеДанные.ПлатежнаяКарта = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПодробноМаскированныйНомерКартыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НомерПлатежнойКартыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставПодробноМаскированныйНомерКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	НомерПлатежнойКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка);
КонецПроцедуры 

&НаКлиенте
Процедура СоставПодробноНомерПлатежнойКартыПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.СоставПодробно.ТекущиеДанные <> Неопределено Тогда   
		Элементы.СоставПодробно.ТекущиеДанные.МаскированныйНомерКарты = МаскированныйНомерКарты(Элементы.СоставПодробно.ТекущиеДанные.НомерПлатежнойКарты);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПодробноНомерПлатежнойКартыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НомерПлатежнойКартыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставПодробноНомерПлатежнойКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	НомерПлатежнойКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежаПодробно

&НаКлиенте
Процедура РасшифровкаПлатежаПодробноПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.СоставПодробно.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран сотрудник!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "СоставПодробно", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПодробноПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.СоставПодробно.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если Копирование Тогда
			РассчитатьИтогСтрокиПоИдентификатору(ТекущиеДанные.ИдентификаторСтроки,"СоставПодробно");
			РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
		ИначеЕсли НоваяСтрока Тогда
			Элементы.РасшифровкаПлатежаПодробно.ТекущиеДанные.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
			Элементы.РасшифровкаПлатежаПодробно.ТекущиеДанные.Контрагент = ТекущиеДанные.Контрагент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПодробноПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		
		ТекущиеДанные = Элементы.РасшифровкаПлатежаПодробно.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			РассчитатьИтогСтрокиПоИдентификатору(ТекущиеДанные.ИдентификаторСтроки,"СоставПодробно");
		КонецЕсли;
		
		РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
		
		СтрокаСостава = Объект.Состав.НайтиСтроки(Новый Структура("ИдентификаторСтроки",
		Элементы.СоставПодробно.ТекущиеДанные.ИдентификаторСтроки));
		ПриПолученииДанныхСтрокиСостава(Объект,СтрокаСостава[0]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПодробноПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежаПодробно.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.СоставПодробно.ТекущиеДанные.Сумма = 0;
	Иначе
		РассчитатьИтогСтрокиПоИдентификатору(ТекущиеДанные.ИдентификаторСтроки,"СоставПодробно");
	КонецЕсли;
	
	СтрокаСостава = Объект.Состав.НайтиСтроки(Новый Структура("ИдентификаторСтроки",
												Элементы.СоставПодробно.ТекущиеДанные.ИдентификаторСтроки));
	ПриПолученииДанныхСтрокиСостава(Объект,СтрокаСостава[0]);
	
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьРеквизитыВоВсехСтроках(Команда)
	ОткрытьФормуЗаполненияРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыВВыбранныхСтроках(Команда)
	ОткрытьФормуЗаполненияРеквизитов(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСумму(Команда)
	
	Если Объект.СуммаДокумента <> Объект.РасшифровкаПлатежа.Итог("Сумма") Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
		РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
		Модифицированность = Истина;
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыпл(Команда) 
	
	ВнесеныИзменения = Ложь;	
	
	Для каждого Строка Из Объект.Состав Цикл   
		
		Если НЕ ВнесеныИзменения И НЕ Строка.Выплачено Тогда
			ВнесеныИзменения = Истина;
		КонецЕсли;			
		Строка.Выплачено = Истина;  
		
	КонецЦикла;	  
	
	Если ВнесеныИзменения Тогда
		Модифицированность = Истина;
	КонецЕсли;	
		
КонецПроцедуры  

&НаКлиенте
Процедура СнятьОтметкиВыпл(Команда) 
	
	ВнесеныИзменения = Ложь;	
	
	Для каждого Строка Из Объект.Состав Цикл   
		
		Если НЕ ВнесеныИзменения И Строка.Выплачено Тогда
			ВнесеныИзменения = Истина;
		КонецЕсли;			
		Строка.Выплачено = Ложь;  
		
	КонецЦикла;	  
	
	Если ВнесеныИзменения Тогда
		Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом  

&НаКлиенте
Процедура ПоказатьНомераКарт(Команда)  
	
	НовааяПометка = НЕ Элементы.СоставПодробноПоказатьНомераКарт.Пометка;
	
	Элементы.СоставПодробноМаскированныйНомерКарты.Видимость = НЕ НовааяПометка; 
	Элементы.СоставПодробноНомерПлатежнойКарты.Видимость = НовааяПометка;
	Элементы.СоставПодробноПоказатьНомераКарт.Пометка = НовааяПометка;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию()
	
	Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация, "Документ.РаспоряжениеОПеречисленииНаКартыМир", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	
	Объект.ЛицевойСчет 				= Умолчания.ЛицевойСчет;
	Объект.РеквизитыЛицевогоСчета 	= Умолчания.РеквизитыЛицевогоСчета;
	Объект.ОрганКазначейства		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
	ПриИзмененииЛицевогоСчетаНаСервере();
	
КонецПроцедуры	

&НаСервере
Процедура ПриИзмененииЛицевогоСчетаНаСервере()
	
	СвойстваЛицевогоСчета = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(Объект.ЛицевойСчет, Объект.Дата); 
	ПлатежноРасчетныеДокументы.ДополнитьСвойстваЛицевогоСчета(Объект.ЛицевойСчет, СвойстваЛицевогоСчета);
   
	ЗаполнитьЗначенияСвойств(Объект, СвойстваЛицевогоСчета);
	
	ДопустимыеКФО = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеКФО(,Объект.ЛицевойСчет);
	СписокДопустимыхКФО.ЗагрузитьЗначения(ДопустимыеКФО);
	
	Для Каждого Стр Из Объект.Состав Цикл
		
		Если СписокДопустимыхКФО.НайтиПоЗначению(Стр.КФО) = Неопределено Тогда
			Стр.КФО = "";
			Если СписокДопустимыхКФО.Количество() > 0 Тогда
				Стр.КФО = СписокДопустимыхКФО[0].Значение;
			КонецЕсли;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(Стр.КФО) Тогда   
			МассивДопустимыеРазделыЛС = СвойстваЛицевогоСчета.РазделыЛСпоКФО[Стр.КФО];
			Если МассивДопустимыеРазделыЛС.Найти(Стр.РазделЛицевогоСчета) = Неопределено Тогда
				Если МассивДопустимыеРазделыЛС.Количество() > 0 Тогда
					Стр.РазделЛицевогоСчета = МассивДопустимыеРазделыЛС[0];			
				Иначе
					Стр.РазделЛицевогоСчета = Неопределено;
				КонецЕсли; 		
			КонецЕсли; 
		Иначе
			Стр.РазделЛицевогоСчета = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЛицевойСчетОрганКазначейства()
	
	Объект.ЛицевойСчет 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "Владелец");
	Объект.ОрганКазначейства 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
	ПриИзмененииЛицевогоСчетаНаСервере();

КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.НомерОбязательства = РаботаСОбязательствами.ПолучитьУчетныйНомерОбязательства(Объект.Договор);
	Иначе
		Объект.НомерОбязательства = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьКонтрагентаСотрудника(Знач СотрудникСсылка, Контрагент, ПлатежнаяКарта, НомерПлатежнойКарты, ДатаРождения, НеИзменятьКарту)
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникСсылка, "Контрагент"); 
	ПолучитьПлатежнуюКарту(Контрагент, ПлатежнаяКарта, НомерПлатежнойКарты, ДатаРождения, НеИзменятьКарту);	
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ПолучитьПлатежнуюКарту(Знач Контрагент, ПлатежнаяКарта, НомерПлатежнойКарты, ДатаРождения, НеИзменятьКарту)
	
	Если НеИзменятьКарту Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Владелец", Контрагент); 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеКартыКонтрагентов.Ссылка КАК Ссылка,
	|	БанковскиеКартыКонтрагентов.Владелец.ЮридическоеФизическоеЛицо.ДатаРождения КАК ДатаРождения,
	|	БанковскиеКартыКонтрагентов.ОсновнойНомерДержателяКарты КАК ОсновнойНомерДержателяКарты
	|ИЗ
	|	Справочник.БанковскиеКартыКонтрагентов КАК БанковскиеКартыКонтрагентов
	|ГДЕ
	|	БанковскиеКартыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И БанковскиеКартыКонтрагентов.Владелец = &Владелец
	|	И БанковскиеКартыКонтрагентов.ЭтоНациональныйПлатежныйИнструмент = ИСТИНА
	|	И БанковскиеКартыКонтрагентов.ВАрхиве = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	БанковскиеКартыКонтрагентов.ДатаИстеченияСрокаДействияКарты УБЫВ";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПлатежнаяКарта = Выборка.Ссылка;
		ДатаРождения = Выборка.ДатаРождения;
		НомерПлатежнойКарты = ?(ЗначениеЗаполнено(Выборка.ОсновнойНомерДержателяКарты),
			Выборка.ОсновнойНомерДержателяКарты.Получить(), ""); 
	Иначе
		ПлатежнаяКарта = ПредопределенноеЗначение("Справочник.БанковскиеКартыКонтрагентов.ПустаяСсылка");
		НомерПлатежнойКарты = "";
		ДатаРождения = "";
	КонецЕсли;
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьРазницуШапкиИИтогаТЧ(Форма)
	
	Объект = Форма.Объект;
	Форма.ИтогПоТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиРасшифровкиПлатежа(ВыделенныеСтроки)
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		Строка = Объект.Состав.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если Строка <> Неопределено Тогда
			
			ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
			МассивКУдалению = Объект.РасшифровкаПлатежа.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
				Объект.РасшифровкаПлатежа.Удалить(СтрокаКУдалению);
			КонецЦикла;
			
		КонецЕсли
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриПолученииДанныхСтрокиСостава(Объект, СтрокаСостава)
	
	СтрокиКлассификацииСотрудника = Объект.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаСостава.ИдентификаторСтроки));
	
	РасшифровкаКлассификации = "";
	
	Для Каждого СтрокаКлассификацииСотрудника Из СтрокиКлассификацииСотрудника Цикл
		
		Если РасшифровкаКлассификации <> "" Тогда
			РасшифровкаКлассификации = РасшифровкаКлассификации + Символы.ПС;
		КонецЕсли;
		
		РасшифровкаКлассификации = РасшифровкаКлассификации + "(";
		РасшифровкаКлассификации = РасшифровкаКлассификации + СтрокаКлассификацииСотрудника.КПС;
		РасшифровкаКлассификации = РасшифровкаКлассификации + "; ";
				
		Если ЗначениеЗаполнено(СтрокаКлассификацииСотрудника.КодЦели) Тогда
			РасшифровкаКлассификации = РасшифровкаКлассификации + "; ";
			РасшифровкаКлассификации = РасшифровкаКлассификации + СтрокаКлассификацииСотрудника.КодЦели;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКлассификацииСотрудника.КодМероприятия) Тогда
			РасшифровкаКлассификации = РасшифровкаКлассификации + "; ";
			РасшифровкаКлассификации = РасшифровкаКлассификации + СтрокаКлассификацииСотрудника.КодМероприятия;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКлассификацииСотрудника.ДопКлассификация) Тогда
			РасшифровкаКлассификации = РасшифровкаКлассификации + "; ";
			РасшифровкаКлассификации = РасшифровкаКлассификации + СтрокаКлассификацииСотрудника.ДопКлассификация;
		КонецЕсли;
		
		РасшифровкаКлассификации = РасшифровкаКлассификации + ") ";
		РасшифровкаКлассификации = РасшифровкаКлассификации + Формат(СтрокаКлассификацииСотрудника.Сумма,"ЧДЦ=2; ЧН=");
		
		РасшифровкаКлассификации = РасшифровкаКлассификации + " ";
			
	КонецЦикла;
	
	СтрокаСостава.Классификация = РасшифровкаКлассификации;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДляРасшифровкиПлатежа(ИдентификаторСтроки)
	
	ОтборСтрок = Элементы.РасшифровкаПлатежаПодробно.ОтборСтрок;
	
	Если ОтборСтрок = Неопределено
		ИЛИ НЕ (ОтборСтрок.Свойство("ИдентификаторСтроки")
				И ОтборСтрок.ИдентификаторСтроки = ИдентификаторСтроки) Тогда
		
		Элементы.РасшифровкаПлатежаПодробно.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ИдентификаторСтроки",ИдентификаторСтроки));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогСтрокиПоИдентификатору(ИдентификаторСтроки, ИмяТаблицыФормы)
	
	ИтогПоРасшифровке = 0;
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	МассивСтрокДляСуммирования = Объект.РасшифровкаПлатежа.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаСуммирования Из МассивСтрокДляСуммирования Цикл
		ИтогПоРасшифровке = ИтогПоРасшифровке + СтрокаСуммирования.Сумма;
	КонецЦикла;
	
	Элементы[ИмяТаблицыФормы].ТекущиеДанные.Сумма = ИтогПоРасшифровке;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьСотрудникКонтрагент(ЭлементыФормы, ПоСотрудникам)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "СоставПодробноСотрудник", "Видимость", ПоСотрудникам);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "СоставПодробноКонтрагент", "Видимость", НЕ ПоСотрудникам);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусДокумента()
	
	ПлатежноРасчетныеДокументыКлиент.ОткрытьФормуИзмененияСтатусаДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	УчетПоИФО = ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО");
	УчетПоПодразделениям = ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставПодробноСумма",
		"ТолькоПросмотр", ЗначениеЗаполнено(Объект.ДокументОснование)); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставПодробноИФО",
		"Видимость", (ЗначениеЗаполнено(Объект.ДокументОснование) И УчетПоИФО));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставПодробноПодразделение",
		"Видимость", (ЗначениеЗаполнено(Объект.ДокументОснование) И УчетПоПодразделениям));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИФО",
		"Видимость", НЕ ЗначениеЗаполнено(Объект.ДокументОснование));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подразделение",
		"Видимость", НЕ ЗначениеЗаполнено(Объект.ДокументОснование));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставПодробноПоказатьНомераКарт",
		"Видимость", БанковскиеКарты.РазрешенПросмотрПолногоНомераКарты());

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставПодробноНомерПлатежнойКарты",
		"КнопкаВыбора", НЕ (ЗначениеЗаполнено(Объект.ДокументОснование))); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставПодробноМаскированныйНомерКарты",
		"КнопкаВыбора", НЕ (ЗначениеЗаполнено(Объект.ДокументОснование)));
			
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	
КонецПроцедуры     

&НаСервере
Процедура УстановитьОтображениеОшибок() 
	
	ДокументБезИзвещения = ?(Объект.Состав.Количество() = 0, Истина, Ложь); 
	                    
	Для Каждого СтрокаПодробно Из Объект.Состав Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаПодробно.ОписаниеОшибки) И СтрокаПодробно.Ошибка = 0 Тогда
			ДокументБезИзвещения = Истина;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ДокументБезИзвещения Тогда  
		
		 Элементы.СоставПодробноОшибка.Вид         = ВидПоляФормы.ПолеВвода;
		 Элементы.СоставПодробноОшибка.Доступность = Ложь;   
		 
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере  
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()  
	
	Для Каждого СтрокаСостава Из Объект.Состав Цикл
		СтрокаСостава.МаскированныйНомерКарты = МаскированныйНомерКарты(СтрокаСостава.НомерПлатежнойКарты); 
		ПриПолученииДанныхСтрокиСостава(Объект, СтрокаСостава);
	КонецЦикла;	
	
КонецПроцедуры	 

&НаКлиентеНаСервереБезКонтекста
Функция МаскированныйНомерКарты(НомерКартыПолный)
	ОсновнойНомерДержателяКарты = БанковскиеКартыСлужебныйКлиентСервер.СкопироватьЦифры(НомерКартыПолный);
	Возврат БанковскиеКартыСлужебныйКлиентСервер.МаскированныйНомер(ОсновнойНомерДержателяКарты); 
КонецФункции

&НаКлиенте
Процедура НомерПлатежнойКартыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;	
	ПараметрыВыбораКарты = Новый Структура; 
	ПараметрыВыбораКарты.Вставить("РежимВыбора", Истина);
	ПараметрыВыбораКарты.Вставить("ТекущаяСтрока", Элементы.СоставПодробно.ТекущиеДанные.ПлатежнаяКарта);
	Если ЗначениеЗаполнено(Элементы.СоставПодробно.ТекущиеДанные.Контрагент) Тогда
		ПараметрыВыбораКарты.Вставить("Отбор", Новый Структура);
		ПараметрыВыбораКарты.Отбор.Вставить("Владелец", Элементы.СоставПодробно.ТекущиеДанные.Контрагент);
		ПараметрыВыбораКарты.Отбор.Вставить("ЭтоНациональныйПлатежныйИнструмент", Истина);
	КонецЕсли;	
	ОткрытьФорму("Справочник.БанковскиеКартыКонтрагентов.ФормаВыбора", ПараметрыВыбораКарты, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НомерПлатежнойКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;    
	ОбработатьВыборКартыНаСервере(Элементы.СоставПодробно.ТекущаяСтрока, ВыбранноеЗначение);
КонецПроцедуры 

&НаСервере
Процедура ОбработатьВыборКартыНаСервере(ИдентификаторСтроки, ПлатежнаяКарта)
	
	Если НЕ ЗначениеЗаполнено(ПлатежнаяКарта) Тогда
		Возврат;
	КонецЕсли;	
		
	ДанныеСтроки = Объект.Состав.НайтиПоИдентификатору(ИдентификаторСтроки);  
	ДанныеДляЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПлатежнаяКарта, 
	         Новый Структура("МаскированныйНомерКарты,Контрагент,ДатаРожденияПолучателя, ОсновнойНомерДержателяКарты", 
			 "Код", "Владелец", "Владелец.ЮридическоеФизическоеЛицо.ДатаРождения", "ОсновнойНомерДержателяКарты"));
			 
	ДанныеДляЗаполнения.Вставить("НомерПлатежнойКарты", ?(ЗначениеЗаполнено(ДанныеДляЗаполнения.ОсновнойНомерДержателяКарты),
			ДанныеДляЗаполнения.ОсновнойНомерДержателяКарты.Получить(), "") ); 
			
	ДанныеДляЗаполнения.Вставить("ПлатежнаяКарта", ПлатежнаяКарта);  
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДанныеДляЗаполнения);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаполненияРеквизитов(ВоВсехСтроках = Истина)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВоВсехСтроках", ВоВсехСтроках);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуЗаполненияРеквизитовОповещение", ЭтотОбъект, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокРеквизитов", СписокРеквизитов());
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("ЛицевойСчет", Объект.ЛицевойСчет);
	
	ОткрытьФорму("Документ.РаспоряжениеОПеречисленииНаКартыМир.Форма.ФормаЗаполненияРеквизитов", 
				ПараметрыФормы, 
				ЭтаФорма, 
				, , , 
				Оповещение, 
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаполненияРеквизитовОповещение(Результат, ДопПараметры) Экспорт
	
	Перем ВоВсехСтроках;
	
	Если Результат = Неопределено Или ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Свойство("ВоВсехСтроках", ВоВсехСтроках);
	
	Если ВоВсехСтроках Тогда
		Для Каждого СтрокаСостав Из Объект.Состав Цикл
			Для Каждого КлючИЗначение Из Результат Цикл
				СтрокаСостав[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЦикла;
		КонецЦикла;
	Иначе
		ВыделенныеСтроки = Элементы.СоставПодробно.ВыделенныеСтроки;
		
		Для Каждого НомерСтроки Из ВыделенныеСтроки Цикл
			СтрокаСостав = Объект.Состав[НомерСтроки];
			Для Каждого КлючИЗначение Из Результат Цикл
				СтрокаСостав[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СписокРеквизитов()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НаименованиеРеквизита");
	Результат.Колонки.Добавить("СинонимРеквизита");
	Результат.Колонки.Добавить("Заполнять");
	Результат.Колонки.Добавить("ЗначениеРеквизита");
	Результат.Колонки.Добавить("ТипЗначенияРеквизита");
	
	Стр = Результат.Добавить();
	Стр.НаименованиеРеквизита = "КФО";
	Стр.СинонимРеквизита = НСтр("ru = 'КФО'");
	Стр.ТипЗначенияРеквизита = Новый ОписаниеТипов("ПеречислениеСсылка.КВД");
	
	Стр = Результат.Добавить();
	Стр.НаименованиеРеквизита = "РазделЛицевогоСчета";
	Стр.СинонимРеквизита = НСтр("ru = 'Раздел лицевого счета'");
	Стр.ТипЗначенияРеквизита = Новый ОписаниеТипов("СправочникСсылка.РазделыЛицевыхСчетов");
	
	Возврат ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	
КонецФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
